TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/ИздательСобытий/ИздательСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИздательСобытий</name>
  <attributes>
    <name>ТипТочкиОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПульса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/ИздательСобытий/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Создает издателя с определенным типом точки обмена "fanout/direct/topic"
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//  ТипОбмена     - тип точки обмена
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция СоздатьПоТипуОбмена(Знач ИмяТочкиДоступа, Знач ТипОбмена, Знач КлючСоединения = "") Экспорт

	Издатель = Обработки.ИздательСобытий.Создать();
	Издатель.ИмяТочкиОбмена = ИмяТочкиДоступа;
	Издатель.ТипТочкиОбмена = ТипОбмена;
	Издатель.КлючСоединения = КлючСоединения;
	
	Возврат Издатель;

КонецФункции // СоздатьПоТипуОбмена()

#КонецОбласти

#КонецЕсли
